<template>
  <div class="container pt-6 sm:pt-10 pb-12 sm:pb-[100px]">
    <h2
      class="text-[#252623] font-bold leading-[40px] break-words sm:leading-[70px] text-4xl sm:text-[58px]"
    >
      {{ $t("terms_of_use") }}
    </h2>
    <p
      class="text-[#252623] font-bold mt-4 sm:mt-8 text-xl sm:text-2xl leading-7 sm:leading-[30px]"
    >
      Конфиденциальность и защита персональных и банковских карточных данных
    </p>
    <p
      class="mt-3 sm:mt-5 text-[#252623] font-medium leading-7 sm:leading-[30px]"
    >
      Конфиденциальность и защита персональных и банковских карточных данных
      являются приоритетными вопросами для нашего приложения, которое использует
      API ChatGPT и других сервисов для обработки запросов пользователей. Мы
      стремимся обеспечить безопасность и конфиденциальность информации, которую
      пользователи передают через наше приложение, в соответствии с требованиями
      правил использования системы и законов о персональных данных в Республике
      Узбекистан.
    </p>
    <p
      class="text-[#252623] font-bold mt-4 sm:mt-8 text-xl sm:text-2xl leading-7 sm:leading-[30px]"
    >
      Сбор и использование персональных и банковских карточных данных
    </p>
    <p
      class="mt-3 sm:mt-5 text-[#252623] font-medium leading-7 sm:leading-[30px]"
    >
      Мы можем собирать определенную информацию от пользователей при
      использовании нашего приложения. Эта информация может включать в себя имя,
      адрес электронной почты, данные банковских карт, и другие контактные
      данные, которые могут быть предоставлены пользователями и держателями
      банковских карт. Мы также можем собирать информацию об устройстве,
      используемом для доступа к нашему приложению, включая IP-адрес, тип
      браузера и операционную систему. Мы используем эту информацию только для
      предоставления услуг нашего приложения и не передаем ее третьим лицам.
    </p>
    <p
      class="text-[#252623] font-bold mt-4 sm:mt-8 text-xl sm:text-2xl leading-7 sm:leading-[30px]"
    >
      Использование информации
    </p>
    <p
      class="mt-3 sm:mt-5 text-[#252623] font-medium leading-7 sm:leading-[30px]"
    >
      Мы используем информацию, которую собираем, только для предоставления
      наших услуг и обеспечения их качества. Мы можем использовать информацию
      для улучшения наших услуг, анализа трендов и поведения пользователей, и
      для предотвращения незаконных действий. Мы не продаем, не обмениваем и не
      передаем информацию третьим лицам без согласия пользователей.
    </p>
    <p
      class="text-[#252623] font-bold mt-4 sm:mt-8 text-xl sm:text-2xl leading-7 sm:leading-[30px]"
    >
      Согласие с политикой конфиденциальности
    </p>
    <p
      class="mt-3 sm:mt-5 text-[#252623] font-medium leading-7 sm:leading-[30px]"
    >
      Использование нашего приложения предполагает согласие пользователей с
      политикой конфиденциальности. Мы требуем, чтобы пользователи принимали
      нашу политику конфиденциальности, прежде чем использовать наше приложение.
      Мы рекомендуем пользователям ознакомиться с политикой конфиденциальности и
      обращаться к ней при необходимости.
    </p>
  </div>
</template>

<script setup lang="ts"></script>
